d = int(input("Введите день рождения:"))
m = int(input("Введите месяц рождения:"))

if (21 <= d <= 31 and m == 3) or (m == 4 and 1 <= d <= 19):
    print("Знак зодиака:Овен")

elif (20 <= d <= 30 and m == 4) or (m == 5 and 1 <= d <= 20):
    print("Знак зодиака:Телец")

elif (21 <= d <= 31 and m == 5) or (m == 6 and 1 <= d <= 21):
    print("Знак зодиака:Близнецы")

elif (22 <= d <= 30 and m == 6) or (m == 7 and 1 <= d <= 22):
    print("Знак зодиака:Рак")

elif (23 <= d <= 31 and m == 7) or (m == 8 and 1 <= d <= 22):
    print("Знак зодиака:Лев")

elif (23 <= d <= 31 and m == 8) or (m == 9 and 1 <= d <= 22):
    print("Знак зодиака:Дева")

elif (23 <= d <= 30 and m == 9) or (m == 10 and 1 <= d <= 23):
    print("Знак зодиака:Весы")

elif (24 <= d <= 31 and m == 10) or (m == 11 and 1 <= d <= 22):
    print("Знак зодиака:Скорпион")

elif (23 <= d <= 30 and m == 11) or (m == 12 and 1 <= d <= 21):
    print("Знак зодиака:Стрелец")

elif (22 <= d <= 31 and m == 12) or (m == 1 and 1 <= d <= 20):
    print("Знак зодиака:Козерог")

elif (21 <= d <= 31 and m == 1) or (m == 2 and 1 <= d <= 18):
    print("Знак зодиака:Водолей")

elif (19 <= d <= 29 and m == 2) or (m == 3 and 1 <= d <= 20):
    print("Знак зодиака:Рыбы")

