#Даны два целых числа A и B (A < B). Найти все целые числа, расположенные между данными числами (включая сами эти числа), в порядке их возрастания, а также количество N этих чисел.
A = 1
B = 10

for i in range(A, B):
    print(i)
